Public Attributes | List of all members
API_MenuParams Struct Reference
Add-On Integration
Describes the menu item that was chosen. More...
#include <APIdefs_Callback.h>
 Public Attributes
 API_MenuItemRef  | menuItemRef
The menu item chosen by the user. The menuItemRef.menuResID is the same what you called ACAPI_MenuItem_InstallMenuHandler with, and also the same what you used in the ACAPI_MenuItem_RegisterMenu as a menu number in the RegisterInterface function.
Detailed Description
Describes the menu item that was chosen.
Remarks
This is the parameter of the APIMenuCommandProc callback function, identifying the menu item your add-on was called for.